app/controllers/movies_controller.rb

  def index
    paramsBonus = Hash.new
    if params[:sort] == nil and not session[:sort] == nil
      paramsBonus[:sort] = "by_name" # session[:sort]
    else
      session[:sort] = params[:sort]
    end
    if params[:ratings] == nil
      if session[:ratings] == nil
	ratings = Hash.new
	Movie.availableRatings.each do |rating|
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13', 'PG') LIMIT 1